# ğŸ‘©â€ğŸ’» ActivitÃ© 3 : mathÃ©matiques pour l'analyse de donnÃ©es

<img src="https://cdn.pixabay.com/photo/2016/03/31/15/28/data-1293312_960_720.png" alt="maths" width="400"/>

#### [Pierre-Loic BAYART](https://www.linkedin.com/in/pierreloicbayart/) - Formation dÃ©veloppeur d'applications spÃ©cialisation data analyst - Webforce3 - Grenoble Ecole de Management

### Code pour indiquer l'importance des notions traitÃ©es dans cette activitÃ©

- #### ğŸ¥‡ : connaissance fondamentale pour l'analyse de donnÃ©es
- #### ğŸ¥ˆ : connaissance importante pour l'analyse de donnÃ©es
- #### ğŸ¥‰ : connaissance moins importante pour l'analyse de donnÃ©es

## ğŸ” Recherche d'informations

En recherchant sur le web, trouver les rÃ©ponses aux questions suivantes :

### - Comment calculer la moyenne arithmÃ©tique ?
___
Pour calculer la moyenne arithmÃ©tique, il faut additionner toutes les valeurs des individus et diviser par le nombre d'individus.

$$\mu= \frac{1}{n}\sum_{i=1}^n x_i$$
___
### - Comment calculer la mÃ©diane ?
___
Il faut **classer** les individus par **ordre croissant**. Si le nombre d'individus est **impair**, la mÃ©diane correspond Ã  la valeur de l'individu au **centre du jeu de donnÃ©es**. Si le nombre d'individus est **pair**, la mÃ©diane correspond Ã  la **moyenne** des valeurs des deux individus au **centre du jeu de donnÃ©es**.

> â„¹ï¸ Illustration avec les salaires. Pour obtenir le salaire mÃ©dian, on classe les individus par salaire croissant et choisi le salaire du milieu (individus "central"):

<img src="https://cdn.pixabay.com/photo/2013/07/13/10/48/pawns-157818_960_720.png" alt="gens" width="400"/>

> Pour obtenir le salaire moyen, on somme tous les salaires et on divise par le nombre d'individus (le salaire que chacun aurait si les salaires Ã©taient Ã©quitablement rÃ©partis):

<img src="https://cdn.pixabay.com/photo/2018/12/23/10/48/money-bag-3890909_960_720.png" alt="or" width="400"/>

___
### - Il existe deux maniÃ¨res d'analyser un jeu de donnÃ©es : soit du point de vue des individus, soit du point de vue des valeurs. Classer les Ã©lÃ¨ments suivants qu'ils sont du point de vue des individus ou des valeurs : moyenne, Ã©cart-type, variance, mÃ©diane, coefficient dâ€™aplatissement (kurtosis), coefficient d'asymÃ©trie (skewness), quantiles, z-score, IQR, boÃ®tes Ã  moustaches (box plot), StandardScaler() de Scikit-Learn, RobustScaler() de Scikit-Learn
___
|Point de vue des individus|Point de vue valeurs|
|-|-|
|MÃ©diane|Moyenne|
|Quantiles|Ecart-type|
|IQR|Variance|
|BoÃ®tes Ã  moustaches (box plot)|Coefficient dâ€™aplatissement (kurtosis)|
|RobustScaler() de Scikit-Learn|Coefficient d'asymÃ©trie (skewness)|
||z-score|
||StandardScaler() de Scikit-Learn|
___

## âœï¸ ActivitÃ©s

- ğŸ¥‡ RÃ©cupÃ©rer les donnÃ©es sur la rÃ©partition des salaires moyens (fichier CSV crÃ©Ã© Ã  l'activitÃ© NÂ°2 - Figure 2) et calculer dans quelle tranche se situe le **salaire mÃ©dian**

> â„¹ï¸ La mÃ©thode de dataframe [`pandas.DataFrame.cumsum()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.cumsum.html) peut vous aider Ã  trouver le salaire mÃ©dian. Cette mÃ©thode permet de calculer la **somme cumulÃ©e** sur les colonnes d'un dataframe

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("figure_2.csv")
df

   Salaires mensuels nets (enÂ euros)  Effectifs (enÂ EQTP)
0                     Moins de 1 200               583943
1                   De 1Â 200 Ã  1Â 300               613321
2                   De 1Â 300 Ã  1Â 400               835135
3                   De 1Â 400 Ã  1Â 500               969172
4                   De 1Â 500 Ã  1Â 600              1052630
..                               ...                  ...
75                  De 8Â 600 Ã  8Â 700                 6138
76                   De 8Â 700 Ã  8800                 5772
77                  De 8Â 800 Ã  8Â 900                 5585
78                  De 8Â 900 Ã  9Â 000                 5408
79                     Plus de 9Â 000               183314

[80 rows x 2 columns]

In [3]:
df["Somme cumulÃ©e des effectifs (enÂ EQTP)"] = df["Effectifs (enÂ EQTP)"].cumsum()

In [4]:
df

,Salaires mensuels nets (enÂ euros),Effectifs (enÂ EQTP),Somme cumulÃ©e des effectifs (enÂ EQTP)
0,Moins de 1 200,583943,583943
1,De 1Â 200 Ã 1Â 300,613321,1197264
2,De 1Â 300 Ã 1Â 400,835135,2032399
3,De 1Â 400 Ã 1Â 500,969172,3001571
4,De 1Â 500 Ã 1Â 600,1052630,4054201
...,...,...,...
75,De 8Â 600 Ã 8Â 700,6138,15173641
76,De 8Â 700 Ã 8800,5772,15179413
77,De 8Â 800 Ã 8Â 900,5585,15184998
78,De 8Â 900 Ã 9Â 000,5408,15190406
79,Plus de 9Â 000,183314,15373720

In [6]:
df[df["Effectifs (enÂ EQTP)"].cumsum()>df["Effectifs (enÂ EQTP)"].sum()//2].head(1)

,Salaires mensuels nets (enÂ euros),Effectifs (enÂ EQTP),Somme cumulÃ©e des effectifs (enÂ EQTP)
9,De 2Â 000 Ã 2Â 100,706339,8353468

- RÃ©cupÃ©rer les donnÃ©es sur la rÃ©partition des salaires moyens (fichier **JSON** crÃ©Ã© Ã  l'activitÃ© NÂ°2 - Figure 3) dans un **dataframe** Pandas

In [7]:
df_json = pd.read_json("figure_3.json")
df_json

               0       1    2
0    1er dÃ©cile   1Â 343   1,1
1     2e dÃ©cile   1Â 507   1,9
2     3e dÃ©cile   1Â 655   2,3
3     4e dÃ©cile   1Â 816   2,6
4       MÃ©diane   2Â 005   2,7
5     6e dÃ©cile   2Â 241   2,9
6     7e dÃ©cile   2Â 562   3,2
7     8e dÃ©cile   3Â 053   3,6
8     9e dÃ©cile   4Â 033   4,3
9   95e centile   5Â 245   4,7
10  99e centile   9Â 638   5,3
11      Moyenne   2Â 518   3,2

- ğŸ¥ˆ VÃ©rifier les **plages d'appartenance** des **dÃ©ciles** et des **centiles** prÃ©sentÃ©s dans le tableau (le premier dÃ©cile vaut 1343â‚¬, il doit Ãªtre dans le plage "de 1300 Ã  1400")

In [8]:
# 1er dÃ©cile : 1343â‚¬
df[df["Effectifs (enÂ EQTP)"].cumsum()>df["Effectifs (enÂ EQTP)"].sum()//10].head(1)

,Salaires mensuels nets (enÂ euros),Effectifs (enÂ EQTP),Somme cumulÃ©e des effectifs (enÂ EQTP)
2,De 1Â 300 Ã 1Â 400,835135,2032399

In [9]:
# 2eme dÃ©cile : 1507â‚¬
df[df["Effectifs (enÂ EQTP)"].cumsum()>df["Effectifs (enÂ EQTP)"].sum()*2//10].head(1)

,Salaires mensuels nets (enÂ euros),Effectifs (enÂ EQTP),Somme cumulÃ©e des effectifs (enÂ EQTP)
4,De 1Â 500 Ã 1Â 600,1052630,4054201

In [10]:
# 3eme dÃ©cile : 1655â‚¬
df[df["Effectifs (enÂ EQTP)"].cumsum()>df["Effectifs (enÂ EQTP)"].sum()*3//10].head(1)

,Salaires mensuels nets (enÂ euros),Effectifs (enÂ EQTP),Somme cumulÃ©e des effectifs (enÂ EQTP)
5,De 1Â 600 Ã 1Â 700,1008034,5062235

In [11]:
# 4eme dÃ©cile : 1816â‚¬
df[df["Effectifs (enÂ EQTP)"].cumsum()>df["Effectifs (enÂ EQTP)"].sum()*4//10].head(1)

,Salaires mensuels nets (enÂ euros),Effectifs (enÂ EQTP),Somme cumulÃ©e des effectifs (enÂ EQTP)
7,De 1Â 800 Ã 1Â 900,863042,6864815

In [12]:
# 6eme dÃ©cile : 2241â‚¬
df[df["Effectifs (enÂ EQTP)"].cumsum()>df["Effectifs (enÂ EQTP)"].sum()*6//10].head(1)

,Salaires mensuels nets (enÂ euros),Effectifs (enÂ EQTP),Somme cumulÃ©e des effectifs (enÂ EQTP)
11,De 2Â 200 Ã 2Â 300,563387,9546987

In [13]:
# 7eme dÃ©cile : 2562â‚¬
df[df["Effectifs (enÂ EQTP)"].cumsum()>df["Effectifs (enÂ EQTP)"].sum()*7//10].head(1)

,Salaires mensuels nets (enÂ euros),Effectifs (enÂ EQTP),Somme cumulÃ©e des effectifs (enÂ EQTP)
14,De 2Â 500 Ã 2Â 600,407908,10911302

In [14]:
# 8eme dÃ©cile : 3053â‚¬
df[df["Effectifs (enÂ EQTP)"].cumsum()>df["Effectifs (enÂ EQTP)"].sum()*8//10].head(1)

,Salaires mensuels nets (enÂ euros),Effectifs (enÂ EQTP),Somme cumulÃ©e des effectifs (enÂ EQTP)
19,De 3Â 000 Ã 3Â 100,241899,12408814

In [15]:
# 9eme dÃ©cile : 4033â‚¬
df[df["Effectifs (enÂ EQTP)"].cumsum()>df["Effectifs (enÂ EQTP)"].sum()*9//10].head(1)

,Salaires mensuels nets (enÂ euros),Effectifs (enÂ EQTP),Somme cumulÃ©e des effectifs (enÂ EQTP)
29,De 4Â 000 Ã 4Â 100,97332,13900452

In [17]:
# 95eme centile : 5245â‚¬
df[df["Effectifs (enÂ EQTP)"].cumsum()>df["Effectifs (enÂ EQTP)"].sum()*95//100].head(1)

,Salaires mensuels nets (enÂ euros),Effectifs (enÂ EQTP),Somme cumulÃ©e des effectifs (enÂ EQTP)
41,De 5Â 200 Ã 5Â 300,38848,14625880

In [18]:
# 99eme centile : 9638â‚¬
df[df["Effectifs (enÂ EQTP)"].cumsum()>df["Effectifs (enÂ EQTP)"].sum()*99//100].head(1)

,Salaires mensuels nets (enÂ euros),Effectifs (enÂ EQTP),Somme cumulÃ©e des effectifs (enÂ EQTP)
79,Plus de 9Â 000,183314,15373720

- ğŸ¥‰ Connaissant la **moyenne globale des salaires nets mensuels**, estimer le **salaire moyen** de la **catÃ©gorie "Plus de 9Â 000"**

In [19]:
df["salaire moyen"] = [600] + [1250+100*i for i in range(78)] + [np.nan]
df

,Salaires mensuels nets (enÂ euros),Effectifs (enÂ EQTP),Somme cumulÃ©e des effectifs (enÂ EQTP),salaire moyen
0,Moins de 1 200,583943,583943,600.0
1,De 1Â 200 Ã 1Â 300,613321,1197264,1250.0
2,De 1Â 300 Ã 1Â 400,835135,2032399,1350.0
3,De 1Â 400 Ã 1Â 500,969172,3001571,1450.0
4,De 1Â 500 Ã 1Â 600,1052630,4054201,1550.0
...,...,...,...,...
75,De 8Â 600 Ã 8Â 700,6138,15173641,8650.0
76,De 8Â 700 Ã 8800,5772,15179413,8750.0
77,De 8Â 800 Ã 8Â 900,5585,15184998,8850.0
78,De 8Â 900 Ã 9Â 000,5408,15190406,8950.0
79,Plus de 9Â 000,183314,15373720,NaN

In [20]:
salaire_moyen = 2518
effectif_total = df["Effectifs (enÂ EQTP)"].sum()
salaire_moyen_plus_9000 = (salaire_moyen*effectif_total - (df.iloc[:-1,1]*df.iloc[:-1,-1]).sum()) / df.iloc[-1,1]
salaire_moyen_plus_9000

16626.625407770272

___
*ğŸ‘¨â€ğŸ« [Pierre-Loic BAYART](https://www.linkedin.com/in/pierreloicbayart/) - Formation dÃ©veloppeur d'applications spÃ©cialisation data analyst - Webforce3 - Grenoble Ecole de Management*
___
Source images d'illustration :

    - Image par OpenClipart-Vectors de Pixabay